Extensions/src/Documents/ПоступлениеНаСчет/ПоступлениеНаСчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПоступлениеНаСчет</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Курс</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СчетКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Касса</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДоговорКредитаЗайма</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подотчетник</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЭквайринговыйТерминал</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаКомиссииДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВалютаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>УчитыватьВНУ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Патент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВариантЗаполненияРасшифровки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДоговорДляЗачетаАвансаСПомощником</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Корреспонденция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидУдержанияНДФЛ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КорреспонденцияРегл</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Кратность</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СуммаУчета</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>АналитикаПрочихДоходовИРасходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидНалога</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПодразделениеЗатраты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельностиЗатраты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидУдержанияПФ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НДФЛПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СуммаПФПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Статья</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>БанковскаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>AzRyJiraCode</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПроектДляЗачетаАвансаСПомощником</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЗагруженоИзБанка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ЭквайринговыеОперации</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>НомерПлатежнойКарты</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>24</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаРасчетовКомиссииВозврата</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Документ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаПлатежа</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаРасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаРасчетовВозврата</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ВидПлатежнойКарты</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаРасчетовКомиссии</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаПлатежаИтогоПоСтроке</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаКомиссииИтогоПоСтроке</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасшифровкаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Договор</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ПризнакАванса</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Документ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаРасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Курс</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>4</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СчетНаОплату</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДокументПланирования</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ТипСуммы</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Проект</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасшифровкаПлатежаОтАгента</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Заказ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НомерЗаказаАгента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПолученоОтКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КорректировкаДолга</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>УдержаноАгентом</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Документ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СчетНаОплату</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоговорыАвтоЗачетаДолгов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>СуммаПлатежа</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

Extensions/src/Enums/ТипыРасчетов/ТипыРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыРасчетов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Аванс</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Долг</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Extensions/src/Documents/ПоступлениеНаСчет/ManagerModule.bsl
&После("СформироватьТаблицаРасчетыСПодотчетниками")
Процедура РасшAzRy_СформироватьТаблицаРасчетыСПодотчетниками(ДокументСсылкаПоступлениеНаСчет, СтруктураДополнительныеСвойства)
	
	Если ДокументСсылкаПоступлениеНаСчет.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.AzRyОтПоставщикаОтПодотчетника Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		
		ТекстЗапроса = "       
		| УНИЧТОЖИТЬ ВременнаяТаблицаРасчетыСПодотчетниками 
		|"; 
		
		Запрос.Текст = ТекстЗапроса; 
		Запрос.Выполнить();
		
		ТекстЗапроса = "       
		| УНИЧТОЖИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПодотчетниками 
		|"; 
		
		Запрос.Текст = ТекстЗапроса; 
		Запрос.Выполнить();
		
		ТекстЗапроса = "       
		| УНИЧТОЖИТЬ ВременнаяТаблицаКурсовыхРазницРасчетыСПодотчетникамиРегл 
		|"; 
		
		Запрос.Текст = ТекстЗапроса; 
		Запрос.Выполнить();	
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПоступлениеНаСчет);
		Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
		Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
		Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
		Запрос.УстановитьПараметр("ПогашениеДолгаПодотчетника", НСтр("ka='საქვეანგარიშო პირის ვალის დაფარვა';ru='Погашение долга подотчетника';en='Repayment of debt podotchetnika'"));
		Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
		
		//ПодольскийАИ #УчетПроектов 09.02.2021 {
		Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
		//ПодольскийАИ #УчетПроектов 09.02.2021 }
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	1 КАК НомерСтроки,
		|	&ПогашениеДолгаПодотчетника КАК СодержаниеПроводки,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ТаблицаДокумента.Ссылка.БанковскийСчет КАК БанковскийСчет,
		|	ТаблицаДокумента.Ссылка.Документ КАК Документ,
		|	ТаблицаДокумента.Ссылка.Подотчетник КАК Сотрудник,
		|	ТаблицаДокумента.Ссылка.Подотчетник.СчетРасчетовСПодотчетниками КАК СчетУчета,
		|	ТаблицаДокумента.Ссылка.Подотчетник.СчетРасчетовСПодотчетникамиРегл КАК СчетУчетаРегл,
		|	ТаблицаДокумента.Ссылка.Дата КАК Дата,
		|	&Организация КАК Организация,
		|	ТаблицаДокумента.AzRyВалюта КАК Валюта,
		|	ТаблицаДокумента.Ссылка.Статья КАК Статья,
		|	СУММА(ТаблицаДокумента.Ссылка.СуммаДокумента * КурсыВалютБанковскогоСчета.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскогоСчета.Кратность)) КАК Сумма,
		|	СУММА(ТаблицаДокумента.СуммаРасчетов) КАК СуммаВал,
		|	-СУММА(ТаблицаДокумента.Ссылка.СуммаДокумента * КурсыВалютБанковскогоСчета.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскогоСчета.Кратность)) КАК СуммаДляОстатка,
		|	-СУММА(ТаблицаДокумента.СуммаРасчетов) КАК СуммаВалДляОстатка,
		|	ТаблицаДокумента.Проект КАК Проект
		|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПодотчетниками
		|ИЗ
		|	Документ.ПоступлениеНаСчет.РасшифровкаПлатежа КАК ТаблицаДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&МоментВремени,
		|				Валюта В
		|					(ВЫБРАТЬ
		|						Константы.ВалютаУчета
		|					ИЗ
		|						Константы КАК Константы)) КАК КурсыВалютУчетаСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютБанковскогоСчета
		|		ПО (ТаблицаДокумента.Ссылка.ВалютаДенежныхСредств = КурсыВалютБанковскогоСчета.Валюта)
		|ГДЕ
		|	ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеНаСчет.AzRyОтПоставщикаОтПодотчетника)
		|	И ТаблицаДокумента.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДокумента.Проект,
		|	ТаблицаДокумента.Ссылка.БанковскийСчет,
		|	ТаблицаДокумента.Ссылка.Документ,
		|	ТаблицаДокумента.Ссылка.Подотчетник,
		|	ТаблицаДокумента.Ссылка.Подотчетник.СчетРасчетовСПодотчетниками,
		|	ТаблицаДокумента.Ссылка.Подотчетник.СчетРасчетовСПодотчетникамиРегл,
		|	ТаблицаДокумента.Ссылка.Дата,
		|	ТаблицаДокумента.Ссылка.Статья,
		|	ТаблицаДокумента.Ссылка.ВалютаДенежныхСредств,
		|	ТаблицаДокумента.AzRyВалюта";
		
		Запрос.Выполнить();
		
		// Установка исключительной блокировки контролируемых остатков расчетов с подотчетными лицами.
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВременнаяТаблицаРасчетыСПодотчетниками.Организация КАК Организация,
		|	ВременнаяТаблицаРасчетыСПодотчетниками.Сотрудник КАК Сотрудник,
		|	ВременнаяТаблицаРасчетыСПодотчетниками.Валюта КАК Валюта,
		|	ВременнаяТаблицаРасчетыСПодотчетниками.Документ КАК Документ
		//ПодольскийАИ #УчетПроектов 10.02.2021 {
		//Исправление ошибок. Было---
		////+++ Дмгг
		//|	ВременнаяТаблицаРасчетыСПодотчетниками.Проект
		////--- Дмгг
		//ПодольскийАИ #УчетПроектов 10.02.2021 }
		|ИЗ
		|	ВременнаяТаблицаРасчетыСПодотчетниками";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПодотчетниками");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
		
		Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
		КонецЦикла;
		Блокировка.Заблокировать();
		
		НомерЗапроса = 0;
		Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПодотчетниками(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПодотчетникамиРегл(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПодотчетниками", МассивРезультатов[НомерЗапроса].Выгрузить());	
		
	КонецЕсли; 
	
КонецПроцедуры

&Вместо("СформироватьТаблицаДенежныеСредства")
Процедура РасшAzRy_СформироватьТаблицаДенежныеСредства(ДокументСсылкаПоступлениеНаСчет, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПоступлениеНаСчет);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ПоступлениеДенежныхСредств", НСтр("ka='ფულადი სახსრების შემოსვლა';ru='Поступление денежных средств';en='Cash inflow'"));
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	Запрос.УстановитьПараметр("ИспользуютсяПереводыВПути",РегистрыСведений.ПрименениеПереводовВПути.ИспользуютсяПереводыВПути(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата,СтруктураДополнительныеСвойства.ДляПроведения.Организация));
	
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("ВалютаДС", ДокументСсылкаПоступлениеНаСчет.ВалютаДенежныхСредств);
	
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированногоПланаСчетов", ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(ДокументСсылкаПоступлениеНаСчет.Дата),ДокументСсылкаПоступлениеНаСчет.Дата,ТекущаяДата())));
	
	
	Если ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь") Тогда
		Итог = ДокументСсылкаПоступлениеНаСчет.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	Иначе
		Итог = 0;
	КонецЕсли;
	ОстатокСуммы = ДокументСсылкаПоступлениеНаСчет.СуммаДокумента - Итог;
	Запрос.УстановитьПараметр("ПлатежныйКалендарь", ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь"));
	Запрос.УстановитьПараметр("ОстатокСуммы", ОстатокСуммы);
	Запрос.УстановитьПараметр("УчетВалютныхОпераций", ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК НомерСтроки,
	|	&ПоступлениеДенежныхСредств КАК СодержаниеПроводки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаДокумента.Дата КАК Дата,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные) КАК ТипДенежныхСредств,
	|	ТаблицаДокумента.Статья КАК Статья,
	|	ТаблицаДокумента.БанковскийСчет КАК БанковскийСчетКасса,
	|	ТаблицаДокумента.БанковскийСчетСчетУчета КАК СчетУчета,
	|	ТаблицаДокумента.БанковскийСчетСчетУчетаРегл КАК СчетУчетаРегл,
	|	ТаблицаДокумента.АналитикаДДС КАК Аналитика,
	|	ТаблицаДокумента.ВалютаДенежныхСредств КАК Валюта,
	|	СУММА(ВЫРАЗИТЬ(&ОстатокСуммы * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))) КАК Сумма,
	|	СУММА(&ОстатокСуммы) КАК СуммаВал,
	|	СУММА(ВЫРАЗИТЬ(&ОстатокСуммы * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаДляОстатка,
	|	СУММА(&ОстатокСуммы) КАК СуммаВалДляОстатка,
	//+++ Дмгг
	|	ТаблицаДокумента.Проект КАК Проект
	//--- Дмгг
	|ПОМЕСТИТЬ ВременнаяТаблицаДенежныеСредства
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчетаСрезПоследних
	|		ПО (КурсыВалютУчетаСрезПоследних.Валюта = &ВалютаУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютКассы
	|		ПО (КурсыВалютКассы.Валюта = &ВалютаДС)
	|ГДЕ
	|	(ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеНаСчет.ОтПодотчетника)
	// +++ { AzRy - [20.09.2021] - Jira: - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеНаСчет.AzRyОтПоставщикаОтПодотчетника)
	// +++ } AzRy - [20.09.2021] - Jira: - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:	
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеНаСчет.Прочее)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеНаСчет.ПрочиеРасчеты)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеНаСчет.ОтКурьерскойКомпанииПочты)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеНаСчет.РасчетыПоКредитам)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеНаСчет.ВозвратЗаймаСотрудником)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеНаСчет.Налоги)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеНаСчет.ВзносНаличными)
	|				И &ИспользуютсяПереводыВПути
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеНаСчет.ПереводСДругогоСчета)
	|				И &ИспользуютсяПереводыВПути)
	|	И &ОстатокСуммы > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.БанковскийСчет,
	|	ТаблицаДокумента.БанковскийСчетСчетУчета,
	|	ТаблицаДокумента.БанковскийСчетСчетУчетаРегл,
	|	ТаблицаДокумента.ВалютаДенежныхСредств,
	|	ТаблицаДокумента.АналитикаДДС,
	//+++ Дмгг
	|	ТаблицаДокумента.Проект
	//--- Дмгг
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	&ПоступлениеДенежныхСредств,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаДокумента.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные),
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.БанковскийСчет,
	|	ТаблицаДокумента.БанковскийСчетСчетУчета,
	|	ТаблицаДокумента.БанковскийСчетСчетУчетаРегл,
	|	ТаблицаДокумента.АналитикаДДС,
	|	ТаблицаДокумента.ВалютаДенежныхСредств,
	|	СУММА(ВЫРАЗИТЬ(&ОстатокСуммы * ТаблицаДокумента.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * ТаблицаДокумента.Кратность) КАК ЧИСЛО(15, 2))),
	|	СУММА(&ОстатокСуммы),
	|	СУММА(ВЫРАЗИТЬ(&ОстатокСуммы * ТаблицаДокумента.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * ТаблицаДокумента.Кратность) КАК ЧИСЛО(15, 2))),
	|	СУММА(&ОстатокСуммы),
	//+++ Дмгг
	|	ТаблицаДокумента.Проект
	//--- Дмгг
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчетаСрезПоследних
	|		ПО (КурсыВалютУчетаСрезПоследних.Валюта = &ВалютаУчета)
	|ГДЕ
	|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеНаСчет.ПокупкаВалюты)
	|	И &ОстатокСуммы > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.БанковскийСчет,
	|	ТаблицаДокумента.АналитикаДДС,
	|	ТаблицаДокумента.БанковскийСчетСчетУчета,
	|	ТаблицаДокумента.БанковскийСчетСчетУчетаРегл,
	|	ТаблицаДокумента.ВалютаДенежныхСредств,
	//+++ Дмгг
	|	ТаблицаДокумента.Проект
	//--- Дмгг
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	&ПоступлениеДенежныхСредств,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные),
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчет,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.АналитикаДДС,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	СУММА(ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаРасшифровкаПлатежа.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (ВременнаяТаблицаРасшифровкаПлатежа.Кратность * КурсыВалютУчетаСрезПоследних.Курс) КАК ЧИСЛО(15, 2))),
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа),
	|	СУММА(ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаРасшифровкаПлатежа.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (ВременнаяТаблицаРасшифровкаПлатежа.Кратность * КурсыВалютУчетаСрезПоследних.Курс) КАК ЧИСЛО(15, 2))),
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа),
	//+++ Дмгг
	|	ВременнаяТаблицаРасшифровкаПлатежа.Проект
	//--- Дмгг
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчетаСрезПоследних
	|		ПО (КурсыВалютУчетаСрезПоследних.Валюта = &ВалютаУчета)
	|ГДЕ
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеНаСчет.ПокупкаВалюты)
	|	И &ПлатежныйКалендарь
	|	И ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчет,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	ВременнаяТаблицаРасшифровкаПлатежа.АналитикаДДС,
	//+++ Дмгг
	|	ВременнаяТаблицаРасшифровкаПлатежа.Проект
	//--- Дмгг
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	&ПоступлениеДенежныхСредств,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные),
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчет,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.АналитикаДДС,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность)),
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа),
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * КурсыВалютКассы.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютКассы.Кратность)),
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа),
	//+++ Дмгг
	|	ВременнаяТаблицаРасшифровкаПлатежа.Проект
	//--- Дмгг
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчетаСрезПоследних
	|		ПО (КурсыВалютУчетаСрезПоследних.Валюта = &ВалютаУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютКассы
	|		ПО (КурсыВалютКассы.Валюта = &ВалютаДС)
	|ГДЕ
	|	(ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеНаСчет.ОтПодотчетника)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеНаСчет.Прочее)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеНаСчет.ПрочиеРасчеты)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеНаСчет.ОтКурьерскойКомпанииПочты)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеНаСчет.РасчетыПоКредитам)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеНаСчет.ВозвратЗаймаСотрудником)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеНаСчет.Налоги)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеНаСчет.ВозвратДенегОтСотрудника) //+++ Дмгг
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеНаСчет.ВзносНаличными)
	|				И &ИспользуютсяПереводыВПути
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеНаСчет.ПереводСДругогоСчета)
	|				И &ИспользуютсяПереводыВПути)
	|	И &ПлатежныйКалендарь
	|	И ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчет,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.АналитикаДДС,
	//+++ Дмгг
	|	ВременнаяТаблицаРасшифровкаПлатежа.Проект
	//--- Дмгг
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	&ПоступлениеДенежныхСредств,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные),
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчет,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Контрагент,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета),
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа),
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета),
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа),
	//+++ Дмгг
	|	ВременнаяТаблицаРасшифровкаПлатежа.Проект
	//--- Дмгг
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
	|ГДЕ
	|	(ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеНаСчет.ОтПокупателя)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеНаСчет.ОтПоставщика)
	|			ИЛИ ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКартам))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчет,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчета,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчетКассаСчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Контрагент,
	//+++ Дмгг
	|	ВременнаяТаблицаРасшифровкаПлатежа.Проект
	//--- Дмгг
	//+++ Дмгг
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1,
	|	&ПоступлениеДенежныхСредств,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаДокумента.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные),
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.БанковскийСчет,
	|	ТаблицаДокумента.БанковскийСчетСчетУчета,
	|	ТаблицаДокумента.БанковскийСчетСчетУчетаРегл,
	|	ТаблицаДокумента.Подотчетник,
	|	ТаблицаДокумента.ВалютаДенежныхСредств,
	|	СУММА(ВЫРАЗИТЬ(&ОстатокСуммы * ТаблицаДокумента.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * ТаблицаДокумента.Кратность) КАК ЧИСЛО(15, 2))),
	|	СУММА(&ОстатокСуммы),
	|	СУММА(ВЫРАЗИТЬ(&ОстатокСуммы * ТаблицаДокумента.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * ТаблицаДокумента.Кратность) КАК ЧИСЛО(15, 2))),
	|	СУММА(&ОстатокСуммы),
	//+++ Дмгг
	|	ТаблицаДокумента.Проект
	//--- Дмгг
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчетаСрезПоследних
	|		ПО (КурсыВалютУчетаСрезПоследних.Валюта = &ВалютаУчета)
	|ГДЕ
	|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеНаСчет.ВозвратДенегОтСотрудника)
	|	И &ОстатокСуммы > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.БанковскийСчет,
	|	ТаблицаДокумента.Подотчетник,
	|	ТаблицаДокумента.БанковскийСчетСчетУчета,
	|	ТаблицаДокумента.БанковскийСчетСчетУчетаРегл,
	|	ТаблицаДокумента.ВалютаДенежныхСредств,
	//+++ Дмгг
	|	ТаблицаДокумента.Проект
	//--- Дмгг
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	ТипДенежныхСредств,
	|	БанковскийСчетКасса,
	|	Валюта,
	|	СчетУчета,
	|	СчетУчетаРегл,
	//+++ Дмгг
	|	Проект";
	//--- Дмгг 
	
	Запрос.Выполнить();
	
	// Установка исключительной блокировки контролируемых остатков денежных средств.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаДенежныеСредства.Организация КАК Организация,
	|	ВременнаяТаблицаДенежныеСредства.ТипДенежныхСредств КАК ТипДенежныхСредств,
	|	ВременнаяТаблицаДенежныеСредства.БанковскийСчетКасса КАК БанковскийСчетКасса,
	|	ВременнаяТаблицаДенежныеСредства.Валюта КАК Валюта,
	//+++ Дмгг
	|	ВременнаяТаблицаДенежныеСредства.Проект КАК Проект
	//--- Дмгг
	|ИЗ
	|	ВременнаяТаблицаДенежныеСредства";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ДенежныеСредства");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыДенежныеСредства(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ТЗРезультатЗапроса = МассивРезультатов[НомерЗапроса].Выгрузить();
	Если ДокументСсылкаПоступлениеНаСчет.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ПокупкаВалюты И ТЗРезультатЗапроса.Количество() > 1 Тогда
		ИтогСуммаУчета = 0;
		Для Каждого ТекущаяСтрока Из ТЗРезультатЗапроса Цикл
			Если ТекущаяСтрока.СуммаВал <> 0 Тогда // Исключаем курсовые разницы.
				ИтогСуммаУчета = ИтогСуммаУчета + ТекущаяСтрока.Сумма;
			КонецЕсли;
		КонецЦикла;
		Если ИтогСуммаУчета <> ДокументСсылкаПоступлениеНаСчет.СуммаУчета Тогда
			Дельта = ИтогСуммаУчета - ДокументСсылкаПоступлениеНаСчет.СуммаУчета;
			ТЗРезультатЗапроса.Сортировать("Сумма Убыв");
			ТЗРезультатЗапроса[0].Сумма = ТЗРезультатЗапроса[0].Сумма - Дельта;
			ТЗРезультатЗапроса.Сортировать("НомерСтроки Возр");
		КонецЕсли;
	КонецЕсли;
	
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыДенежныеСредстваРегл(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Если ДокументСсылкаПоступлениеНаСчет.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ПокупкаВалюты И ТЗРезультатЗапроса.Количество() > 1 Тогда
		ИтогСуммаУчета = 0;
		Для Каждого ТекущаяСтрока Из ТЗРезультатЗапроса Цикл
			Если ТекущаяСтрока.СуммаВал <> 0 Тогда // Исключаем курсовые разницы.
				ИтогСуммаУчета = ИтогСуммаУчета + ТекущаяСтрока.Сумма;
			КонецЕсли;
		КонецЦикла;
		Если ИтогСуммаУчета <> ДокументСсылкаПоступлениеНаСчет.СуммаУчета Тогда
			Дельта = ИтогСуммаУчета - ДокументСсылкаПоступлениеНаСчет.СуммаУчета;
			ТЗРезультатЗапроса.Сортировать("Сумма Убыв");
			ТЗРезультатЗапроса[0].Сумма = ТЗРезультатЗапроса[0].Сумма - Дельта;
			ТЗРезультатЗапроса.Сортировать("НомерСтроки Возр");
		КонецЕсли;
	КонецЕсли;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДенежныеСредства", ТЗРезультатЗапроса);
	
КонецПроцедуры

&Вместо("СформироватьТаблицаРасчетыСПокупателями")
Процедура РасшAzRy_СформироватьТаблицаРасчетыСПокупателями(ДокументСсылкаПоступлениеНаСчет, СтруктураДополнительныеСвойства)
	
	Если Не ДокументСсылкаПоступлениеНаСчет.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено Тогда
		ПродолжитьВызов(ДокументСсылкаПоступлениеНаСчет, СтруктураДополнительныеСвойства);
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПоступлениеНаСчет);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ВозникновениеАвансаПокупателя", "Возникновение аванса покупателя");
	Запрос.УстановитьПараметр("ПогашениеОбязательствПокупателя", "Погашение обязательств покупателя");
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	
	//ПодольскийАИ #УчетПроектов 09.02.2021 {
	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	//ПодольскийАИ #УчетПроектов 09.02.2021 }
	
	// +++ { AzRy - [28.01.2022] - Developer:გიორგი მამულაშვილი - Comment: 
	Запрос.УстановитьПараметр("ЗачетАванса", НСтр("ka='წინასწარ გადახდილი თანხის ჩათვლა';ru='Зачет предоплаты';en='Зачет предоплаты'"));
	// +++ } AzRy - [28.01.2022] - Developer:გიორგი მამულაშვილი - Comment:	
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|						ТОГДА &Ссылка
	|					ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Документ
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА &ВозникновениеАвансаПокупателя
	|		ИНАЧЕ &ПогашениеОбязательствПокупателя
	|	КОНЕЦ КАК СодержаниеПроводки,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчет КАК БанковскийСчет,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья КАК Статья,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаАвансовПокупателя
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаРасчетовСПокупателем
	|	КОНЕЦ КАК СчетУчета,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаАвансовПокупателяРегл
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаРасчетовСПокупателемРегл
	|	КОНЕЦ КАК СчетУчетаРегл,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Договор КАК Договор,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаРасчетов КАК Валюта,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств КАК ВалютаДенежныхСредств,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоЗаказам
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ КАК Заказ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|	КОНЕЦ КАК ТипРасчетов,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа) КАК СуммаПлатежа,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета) КАК Сумма,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов) КАК СуммаВал,
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета) КАК СуммаДляОстатка,
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов) КАК СуммаВалДляОстатка,
	//+++ Дмгг
	|	ВременнаяТаблицаРасшифровкаПлатежа.Проект КАК Проект
	//--- Дмгг
	
	// +++ { AzRy - [28.01.2022] - Developer:გიორგი მამულაშვილი - Comment: 
	|	,Истина КАК ВестиРасчетыПоДокументам
	// +++ } AzRy - [28.01.2022] - Developer:გიორგი მამულაშვილი - Comment:
	
	//|   ,ЗНАЧЕНИЕ(Документ.ПриходнаяНакладная.ПустаяСсылка) КАК AzRyАналитикаКонтрагент
	
	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПокупателями
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
	|ГДЕ
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеНаСчет.ОтПокупателя)
	|
	|СГРУППИРОВАТЬ ПО
	//+++ Дмгг
	|	ВременнаяТаблицаРасшифровкаПлатежа.Проект,
	//--- Дмгг
	// +++ { AzRy - [28.01.2022] - Developer:გიორგი მამულაშვილი - Comment: 
	|	Истина,
	// +++ } AzRy - [28.01.2022] - Developer:გიორგი მამულაშვილი - Comment:
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	ВременнаяТаблицаРасшифровкаПлатежа.БанковскийСчет,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Контрагент,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Договор,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаРасчетов,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Статья,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|						ТОГДА &Ссылка
	|					ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Документ
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА &ВозникновениеАвансаПокупателя
	|		ИНАЧЕ &ПогашениеОбязательствПокупателя
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаАвансовПокупателя
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаРасчетовСПокупателем
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаАвансовПокупателяРегл
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетУчетаРасчетовСПокупателемРегл
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ВестиРасчетыПоЗаказам
	|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	//+++ Дмгг
	|	Проект,
	//--- Дмгг
	|	Организация,
	|	Контрагент,
	|	Договор,
	|	Валюта,
	|	Документ,
	|	Заказ,
	|	ТипРасчетов,
	|	СчетУчета,
	|	СчетУчетаРегл"; //+++ Дмгг
	
	// +++ { AzRy - [28.01.2022] - Developer:გიორგი მამულაშვილი - Comment: 
	AzRyУправлениеНебольшойФирмойСервер.ПриходнаяНакладная_ИнициализироватьДанныеДокумента_ДопТекстЗапроса("ПоступлениеНаСчет", Запрос, ДокументСсылкаПоступлениеНаСчет.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено, "РасшифровкаПлатежа");	
	// +++ } AzRy - [28.01.2022] - Developer:გიორგი მამულაშვილი - Comment:	
	
	Запрос.Выполнить();
	
	// Установка исключительной блокировки контролируемых остатков расчетов с контрагентами.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаРасчетыСПокупателями.Организация КАК Организация,
	|	ВременнаяТаблицаРасчетыСПокупателями.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаРасчетыСПокупателями.Договор КАК Договор,
	|	ВременнаяТаблицаРасчетыСПокупателями.Документ КАК Документ,
	|	ВременнаяТаблицаРасчетыСПокупателями.Заказ КАК Заказ,
	|	ВременнаяТаблицаРасчетыСПокупателями.ТипРасчетов КАК ТипРасчетов
	//ПодольскийАИ #УчетПроектов 10.02.2021 {
	//Исправление ошибок. Было---
	////+++ Дмгг
	//|	ВременнаяТаблицаРасчетыСПокупателями.Проект КАК Проект
	////--- Дмгг
	//ПодольскийАИ #УчетПроектов 10.02.2021 }
	|   ,ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК AzRyАналитикаКонтрагент
	|ИЗ
	|	ВременнаяТаблицаРасчетыСПокупателями";
	
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Блокировка = Новый БлокировкаДанных;
	//ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПокупателями");
	//ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	//ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	//
	//Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
	//	ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	//КонецЦикла;
	// +++ { AzRy - [17.12.2021] - Jira: - Developer:გიორგი მამულაშვილი - Comment:
    //ЭлементБлокировки.ИспользоватьИзИсточникаДанных("AzRyАналитикаКонтрагент", "AzRyАналитикаКонтрагент");
	// +++ } AzRy - [17.12.2021] - Jira: - Developer:გიორგი მამულაშვილი - Comment:	
	
	//Блокировка.Заблокировать();
	
	// +++ { AzRy - [28.01.2022] - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:
	Если ДокументСсылкаПоступлениеНаСчет.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено Тогда
		
		// +++ { AzRy - [28.12.2021] - Jira:ERPM-223 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:კურსი დოკ. კურსზე დავსვით
		Запрос.УстановитьПараметр("КурсыВалютРасчетовСрезПоследних_Курс", ДокументСсылкаПоступлениеНаСчет.Курс);
		Запрос.УстановитьПараметр("КурсыВалютРасчетовСрезПоследних_Кратность", ДокументСсылкаПоступлениеНаСчет.Кратность);
		// +++ } AzRy - [28.12.2021] - Jira:ERPM-223 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:კურსი დოკ. კურსზე დავსვით
		
		// +++ { AzRy - [28.12.2021] - Developer:გიორგი მამულაშვილი - Comment:
		AzRyУправлениеНебольшойФирмойСервер.Сформировать_ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателямиПредварительная3(Запрос);
		// +++ } AzRy - [28.12.2021] - Developer:გიორგი მამულაშვილი - Comment:
		
		НомерЗапроса = 0;
		Запрос.Текст = AzRyУправлениеНебольшойФирмойСервер.AzRy_ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПокупателями(Запрос.МенеджерВременныхТаблиц, Истина, НомерЗапроса, ДокументСсылкаПоступлениеНаСчет);
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		НомерЗапроса = 0;
		Запрос.Текст = AzRyУправлениеНебольшойФирмойСервер.AzRy_ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПокупателямиРегл(Запрос.МенеджерВременныхТаблиц, Истина, НомерЗапроса, ДокументСсылкаПоступлениеНаСчет);
		МассивРезультатов = Запрос.ВыполнитьПакет();		
	Иначе 	
		НомерЗапроса = 0;
		Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПокупателями(Запрос.МенеджерВременныхТаблиц, Ложь, НомерЗапроса);
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПокупателямиРегл(Запрос.МенеджерВременныхТаблиц, Ложь, НомерЗапроса);
		МассивРезультатов = Запрос.ВыполнитьПакет();
	КонецЕсли;
	// +++ } AzRy - [28.01.2022] - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:	
		
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПокупателями", МассивРезультатов[НомерЗапроса].Выгрузить());
	
КонецПроцедуры

&После("ИнициализироватьДанныеДокумента")
Процедура РасшAzRy_ИнициализироватьДанныеДокумента(ДокументСсылкаПоступлениеНаСчет, СтруктураДополнительныеСвойства)
	
	Если СтруктураДополнительныеСвойства.ДляПроведения.Ссылка.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено Тогда
		Для каждого ТекСтрока Из СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный Цикл		
			Если ТекСтрока.СчетКт = ПланыСчетов.Хозрасчетный.Вспомогательный Тогда		
				ТекСтрока.СчетКт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("8240/2");				
			КонецЕсли;
			Если ТекСтрока.СчетДт = ПланыСчетов.Хозрасчетный.Вспомогательный Тогда		
				ТекСтрока.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("8240/2");				
			КонецЕсли;
		КонецЦикла;			
	КонецЕсли;
	
КонецПроцедуры
